# GetRibbonPanels Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..GetRibbonPanels Method
UIApplication Class See Also
---
Get all the custom Panels on Add-Ins tab of Revit.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual List<RibbonPanel> GetRibbonPanels()
```

Visual Basic
---
```text
Public Overridable Function GetRibbonPanels As List(Of RibbonPanel)
```

Visual C++
---
```text
public:
virtual List<RibbonPanel^>^ GetRibbonPanels()
```

# Remarks
The built-in panels won't be included and the panels added to tabs other than Add-Ins will not be included. This method is not supported in Macros.
# See Also
UIApplication Class
GetRibbonPanels Overload
Autodesk.Revit.UI Namespace